Revit 2024 API
View3D.SetOrientation Method
 Sets the temporary orientation of the View3D. The new orientation is not saved in the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void SetOrientation(
	ViewOrientation3D newViewOrientation3D
)
Visual Basic
Public Sub SetOrientation ( _
	newViewOrientation3D As ViewOrientation3D _
)
Visual C++
public:
void SetOrientation(
	ViewOrientation3D^ newViewOrientation3D
)
Parameters
newViewOrientation3D
Type: Autodesk.Revit.DB.ViewOrientation3D
 The new orientation to set.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  View is locked and cannot be reoriented.
See Also
View3D Class
Autodesk.Revit.DB Namespace